Autodesk.Revit.DB.Leader.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Leader.LeaderShape
Geometric style of the leader
Remarks:
While this property cannot be changed directly, it can change, with limitations,
as an effect of other changes to either the leader itself or the annotation element
the leader is associated with. For example, straight-line leaders have no elbow
points; but if an elbow point is set for a straight leader, which is allowed, it will
effectively change the leader's shape to a kinked line.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The leader is not currently owned by a valid element. A probable reason for that
could be if the element has been independently deleted, or the leader has never
been properly initialized.
Since:
2016

Autodesk.Revit.DB.Leader.Anchor
Anchor point of the Leader
Remarks:
Anchor is the leader's point that is attached to an annotation (a tag, note, etc.)
This is a read-only property, for the this point gets always computed based on various
properties of the annotation element.
Since:
2016

Autodesk.Revit.DB.Leader.Elbow
Elbow point of the Leader.
Remarks:
This is the mid-point of the leader and its purpose depends on the
shape of the leader. For arc-shaped leaders it defines the radius
of the arc. For a kinked leader it divides the leader line and
shoulder line.
Note that straight-line leaders do not have an actual elbow; however,
the value can still be obtained, although it will always equal the current
anchor point. Consequently, an elbow point can be set even on a straight-line
leader, but doing so will automatically change the leader's shape property.
It is allowed to set the  Elbow point of a kinked leader to equal either
the end point or anchor point of the leader. Doing so will effectively
change the leader's shape to a straight line. However, the elbow of an arc
leader is never allowed to be placed on either the end or anchor point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
When setting this property: An arc leader may not have its Elbow point placed at the current position of the leader's Anchor or End point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The leader is not currently owned by a valid element. A probable reason for that
could be if the element has been independently deleted, or the leader has never
been properly initialized.

Autodesk.Revit.DB.Leader.End
End point of the Leader.
Remarks:
The End point is the leader's end that points to the object being annotated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
When setting this property: The leader's End point may not be placed at the current position of the Anchor or Elbow point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The leader is not currently owned by a valid element. A probable reason for that
could be if the element has been independently deleted, or the leader has never
been properly initialized.

Autodesk.Revit.DB.Leader
A leader object that can be attached to annotation elements such as text notes.
Remarks:
For information on how to attach or get leaders to/from a text annotation
refer to corresponding methods of Autodesk::Revit::DB::TextNote class.